# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

number = int(input('Введите десятичное число: '))
print('{0:b}'.format(number))